databank-copy3/app/controllers/performances_controller.rb

SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = NULL LIMIT 1
---
    def new
      @shop_list = ShopList.find(params[:shop_list_id])

INSERT INTO `performances` (`day`, `wimax`, `uqm`, `ym_wifi`, `sb_net`, `sb_wifi`, `au_net`, `au_wifi`, `do_net`, `sb_phone`, `au_phone`, `do_phone`, `ym_phone`, `shop_list_id`, `created_at`, `updated_at`) VALUES ('2017-09-01', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, '2017-09-09 08:18:28', '2017-09-09 08:18:28')
SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1
UPDATE `performances` SET `wimax` = 2, `uqm` = 2, `ym_wifi` = 2, `sb_net` = 2, `sb_wifi` = 2, `au_net` = 2, `au_wifi` = 2, `do_net` = 2, `sb_phone` = 2, `au_phone` = 2, `do_phone` = 2, `ym_phone` = 2, `updated_at` = '2017-09-11 10:36:00' WHERE `performances`.`id` = 34
---
    def create
#@pf
      @pf = Performance.create(create_params)
      @shop_list = ShopList.find(params[:shop_list_id])

      if @pf.save