databank-copy3/app/controllers/shop_lists_controller.rb

SELECT `shop_lists`.* FROM `shop_lists`
---
    def index
      @shop_lists = ShopList.all

SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = NULL LIMIT 1
SELECT SUM(`performances`.`wimax`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT `performances`.`wimax` FROM `performances` WHERE (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`uqm`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT `performances`.`wimax`, `performances`.`uqm` FROM `performances` WHERE (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`ym_wifi`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`sb_net`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`sb_wifi`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`au_net`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`au_wifi`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`do_net`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`sb_phone`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`au_phone`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT SUM(`performances`.`do_phone`) FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
---
    def show
      @shop_list = ShopList.find(params[:id])

      # binding.pry
      @performances = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:wimax).sum(:wimax)
      # @performances = Performance.where(day: Time.now.all_month).select(:wimax).sum(:wimax)
      @performances2 = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:uqm).sum(:uqm)
      # @performances2 = Performance.where(day: Time.now.all_month).select(:uqm).sum(:uqm)
      @ym_wifi = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:ym_wifi).sum(:ym_wifi)
      @sb_net = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:sb_net).sum(:sb_net)
      @sb_wifi = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:sb_wifi).sum(:sb_wifi)
      @au_net = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:au_net).sum(:au_net)
      @au_wifi = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:au_wifi).sum(:au_wifi)
      @do_net = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:do_net).sum(:do_net)

      @sb_phone = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:sb_phone).sum(:sb_phone)
      @au_phone = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:au_phone).sum(:au_phone)
      @do_phone = Performance.where(day: Time.now.all_month,shop_list_id: params[:id]).select(:do_phone).sum(:do_phone)

SELECT `performances`.* FROM `performances`
---
  def new
    @pf_csv = Performance.all

SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 2 LIMIT 1
SELECT `performances`.* FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
---
  def view
    @id=params[:id]
    @shop_list = ShopList.find(params[:id])
    @time = Time.now.all_month
    @pf = Performance.where(shop_list_id: @id,day: @time)

SELECT SUM(`performances`.`wimax`) AS sum_wimax, shop_list_id AS shop_list_id FROM `performances` WHERE (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999') GROUP BY `performances`.`shop_list_id`  ORDER BY `performances`.`wimax` DESC
SELECT shop_list_id,SUM(:wimax) AS sum_price FROM `performances` WHERE (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999') GROUP BY `performances`.`wimax`
SELECT SUM(`performances`.`uqm`) AS sum_uqm, shop_list_id AS shop_list_id FROM `performances` WHERE (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999') GROUP BY `performances`.`shop_list_id`  ORDER BY `performances`.`uqm` DESC
---
  def setting

    @time = Time.now.all_month

    @ranking_net_keys = Performance.where(day: @time).order(wimax: :desc).group(:shop_list_id).sum(:wimax).keys
    @ranking_net_values = Performance.where(day: @time).order(wimax: :desc).group(:shop_list_id).sum(:wimax).values

    @ranking_phone_keys = Performance.where(day: @time).order(uqm: :desc).group(:shop_list_id).sum(:uqm).keys

SELECT `performances`.* FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-08-31 15:00:00.000000' AND '2017-09-30 14:59:59.999999')
SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1
---
  def csvprint
    @id=params[:id]
    @time = Time.now.all_month
    @pf = Performance.where(shop_list_id: @id,day: @time)

  @shop_name = ShopList.find(@id).name

SELECT `performances`.* FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-07-31 15:00:00.000000' AND '2017-08-31 14:59:59.999999')
SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1
---
def csvprint1
  @id=params[:id]

  @time1= 1.months.ago(Time.now).all_month
  @pf = Performance.where(shop_list_id: @id,day: @time1)
  @time= 1.months.ago(Time.now)
  @shop_name = ShopList.find(@id).name

SELECT `performances`.* FROM `performances` WHERE `performances`.`shop_list_id` = 1 AND (`performances`.`day` BETWEEN '2017-06-30 15:00:00.000000' AND '2017-07-31 14:59:59.999999')
SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1
---
def csvprint2
    @id=params[:id]

    @time2= 2.months.ago(Time.now).all_month
    @pf = Performance.where(shop_list_id: @id,day: @time2)

    @time= 2.months.ago(Time.now)
    @shop_name = ShopList.find(@id).name