databank-copy3/app/views/shop_lists/setting.html.erb

SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1
---
<%= a %> 位
<%= ShopList.find(ranking_net_key).name %>