databank-copy3/app/views/notice/sendmail_setting.html.erb

<%= a %> 位
<%= ShopList.find(ranking_net_key).name %>
---
SELECT  `shop_lists`.* FROM `shop_lists` WHERE `shop_lists`.`id` = 1 LIMIT 1